---
kind: property
id: P:Autodesk.Revit.DB.Visual.Noise.TextureRealWorldOffsetZ
source: html/0d1f4cbb-dd95-5b42-42b9-b59c03296985.htm
---
# Autodesk.Revit.DB.Visual.Noise.TextureRealWorldOffsetZ Property

The property labeled "Offset Z" from the "Noise" schema.

## Syntax (C#)
```csharp
public static string TextureRealWorldOffsetZ { get; }
```

## Remarks
This property is of type "AssetPropertyDistance".